"\nOur airplanes can also carry 20 tons while crossing the Pacific ocean in 10 hours, and that is something an eagle or an albatross is legitimately not close to doing.  It's genuinely not clear biological evolution ever would or could get that kind of speed and carrying capacity, even if some environmental challenge selected for faster, bigger birds over a hundred million years; there are basic obstacles to doing that sort of thing with proteins (the basic building blocks of biology) rather than, say, metals.  And natural selection is not a sort of thing that can just start over with a new non-protein system; natural selection works by blindly tweaking previous systems.  Proteins are literally as old as life on Earth, and there is no known life that does not run on proteins; not because proteins are optimal, but because natural selection is not a sort of thing that can start over and envision a completely different system.\n\nPigeons can reproduce, and heal their injuries, and the airplanes of humanity cannot. But humanity somehow got to airplanes through a faster route than natural selection building the pigeon, and we point at those things which let us work faster.  We used sketches and designs and computer simulations and small-scale models, before producing an Airbus A320  from raw materials.  We built Airbus A320s in our extended imagination (counting written blueprints as a form of augmented imagination) before building them in reality; without fully building and testing and discarding literal millions of intermediate forms, the way natural selection would have needed to solve that problem if it could solve that problem at all.\n\nWe gesture at the Airbus A320 that flies faster than a pigeon, and was designed much much faster than pigeons evolved.  We say that this has to do with humanity making things in a different way than evolution does: quicker to learn; more able to leap through large gaps in the design space, by making many simultaneous changes that depend on each other; able to start over from scratch with new materials; and at least sometimes able to correct errors by visualizing designs in our imaginations, without needing to watch an obviously flawed plan fail.  This is not meant as a definition of \"intelligence\", but it has something to do with the subject matter we want to talk about. \n\n"
