"\nSo I begin by pointing at \"intelligence\" as it exists within the world.\n\nI gesture at humans, and at mice.  Mice build nests in the walls of our houses.  We fell forests to erect those houses, and we also mine metals and erect skyscrapers.  This is a difference between us and mice.  (If this sounds obvious, that's fine, it's meant to be; there's nothing wrong with beginning from the obvious, when somebody asks you to point at things.)  If you look at the visible processes leading up to the difference, it's that humans have discovered truths about metals and metallurgy, which, even if somebody tried to explain to a mouse, the mouse could not learn.  This is widely believed to have something to do with a difference between mouse brains and human brains.  We agree with this widespread belief.  We point to the different powers of mouse brains and human brains, the different things they can learn and do in the world; this is not a definition of intelligence, but it is a beginning thing to point to in the world, when we want to say what it is that we are talking about.\n\nHumans have no rivals among particular animal species in the world, when it comes to building skyscrapers.  You could, however, say that humanity already has a rival at figuring out interesting tricks, an ancient rival, far older than humanity itself: namely, the process of natural selection.  DNA encodes blueprints for making animals, sometimes errors happen in those blueprints, sometimes the resulting animal does a better job of reproducing itself and replicating its DNA; hundreds of millions of years after this process got started, it coughed out mice.  Humanity built skyscrapers, but even we have never built a whole entire mouse.  Our biotechnology industry is barely getting started on making tweaks to cells. \n\nOn the other hand, humanity does seem to be learning and gaining power much faster than natural selection.  We have not built a mouse, but we have also not spent anything like the hundreds of millions of years that natural selection takes to build mice from scratch.  DNA's structure was discovered less than a century ago (1953).  Our current airplanes can't reproduce in the wild, but two hundred years ago they weren't flying at all.\n\n"
